CSI API ETABS v1
cSpandrelLabel.SetSpandrel Method
 Adds a new Spandrel Label, or modifies an existing Spandrel Label
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSpandrel(
	string Name,
	bool IsMultiStory
)
Function SetSpandrel (
	Name As String,
	IsMultiStory As Boolean
) As Integer
Dim instance As cSpandrelLabel
Dim Name As String
Dim IsMultiStory As Boolean
Dim returnValue As Integer
returnValue = instance.SetSpandrel(Name,
	IsMultiStory)
int SetSpandrel(
	String^ Name,
	bool IsMultiStory
)
abstract SetSpandrel :
        Name : string *
        IsMultiStory : bool -> int
Parameters
Name
Type: System.String
 The name of a Spandrel Label. If this is the name of an existing spandrel label, that spandrel label is modified, otherwise a new spandrel label is added.
IsMultiStory
Type: System.Boolean
 Whether the Spandrel Label spans multiple story levels
Return Value
Type: Int32
 Returns zero if the Spandrel Label is successfully added or modified, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim MyName As String()
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel", False)
'modify Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel", True)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cSpandrelLabel Interface
ETABSv1 Namespace